In [1]:
import numpy as np
import pandas as pd

In [2]:
# 创建随机数生成器
rng = np.random.default_rng(seed=1234)

# 7.1 处理缺失值，哨兵值

In [3]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])

float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [4]:
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data = pd.Series(['aardvark', np.nan, None, 'avocado'])

string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [6]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [7]:
float_data = pd.DataFrame(rng.standard_normal((3,3)), 
                          dtype='float64', 
                          columns=['a', 'b', 'c'])

float_data

          a         b         c
0 -1.603837  0.064100  0.740891
1  0.152619  0.863744  2.913099
2 -1.478823  0.945473 -1.666135

In [8]:
float_data.iloc[:2, 2] = np.nan
float_data.isna()

       a      b      c
0  False  False   True
1  False  False   True
2  False  False  False

In [9]:
float_data.loc[[0,2] , ['a', 'b']] = np.nan # loc() 根据标签索引
float_data.isna()

       a      b      c
0   True   True   True
1  False  False   True
2   True   True  False

## 过滤缺失值

In [10]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

data.dropna() # 过滤缺失值

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notna()] # =data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
dataf = pd.DataFrame(rng.standard_normal((4,3)))
dataf.iloc[1:3, 1:] = np.nan
dataf.iloc[2:, 0] =np.nan
dataf

          0         1         2
0  0.343745 -0.512444  1.323759
1 -0.860280       NaN       NaN
2       NaN       NaN       NaN
3       NaN -1.002166  0.268346

In [13]:
dataf.dropna()

          0         1         2
0  0.343745 -0.512444  1.323759

In [14]:
dataf.dropna(how='all')
#    - `'any'` (默认)："零容忍"策略 - 确保每个保留的观测都是完整的
#   - `'all'`："最大限度保留"策略 - 只删除完全没有信息的行/列

          0         1         2
0  0.343745 -0.512444  1.323759
1 -0.860280       NaN       NaN
3       NaN -1.002166  0.268346

In [15]:
dataf[4] = np.nan
dataf

          0         1         2   4
0  0.343745 -0.512444  1.323759 NaN
1 -0.860280       NaN       NaN NaN
2       NaN       NaN       NaN NaN
3       NaN -1.002166  0.268346 NaN

In [16]:
dataf.dropna(axis='columns', how='all')

          0         1         2
0  0.343745 -0.512444  1.323759
1 -0.860280       NaN       NaN
2       NaN       NaN       NaN
3       NaN -1.002166  0.268346

In [17]:
df = pd.DataFrame(rng.standard_normal((7, 3)))
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan

df

          0         1         2
0  0.767175       NaN       NaN
1  0.696279       NaN       NaN
2  0.013182       NaN -0.620532
3  1.331214       NaN -0.481484
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

In [18]:
df.dropna()

          0         1         2
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

In [19]:
df.dropna(thresh=2) # threshold = 2 设置一个阈值

          0         1         2
2  0.013182       NaN -0.620532
3  1.331214       NaN -0.481484
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

## 补充缺失值

In [20]:
df.fillna(0)

          0         1         2
0  0.767175  0.000000  0.000000
1  0.696279  0.000000  0.000000
2  0.013182  0.000000 -0.620532
3  1.331214  0.000000 -0.481484
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

用字典调用 `fillna` 时，你可以为每列使用不同的填充值：

In [21]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0  0.767175  0.500000  0.000000
1  0.696279  0.500000  0.000000
2  0.013182  0.500000 -0.620532
3  1.331214  0.500000 -0.481484
4 -2.491790 -0.876564 -0.505509
5 -1.283129 -1.330328  0.825993
6 -0.247215 -1.699706 -1.335153

用于`.reindex()`的插值方法（见表 5.3）也可以用于 `fillna`：

In [22]:
df = pd.DataFrame(rng.standard_normal((6,3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan

df

          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090       NaN -0.221804
3  0.648817       NaN -0.010978
4  1.665417       NaN       NaN
5  2.799627       NaN       NaN

In [23]:
df.fillna(method='ffill') # 将过时

/var/folders/1m/2jsf455s4r7dx9t8l233n55c0000gp/T/ipykernel_27139/279806938.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill') # 将过时

          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090 -0.487325 -0.221804
3  0.648817 -0.487325 -0.010978
4  1.665417 -0.487325 -0.010978
5  2.799627 -0.487325 -0.010978

In [24]:
df.ffill()

          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090 -0.487325 -0.221804
3  0.648817 -0.487325 -0.010978
4  1.665417 -0.487325 -0.010978
5  2.799627 -0.487325 -0.010978

In [25]:
df.ffill(limit=1) # 填充数 = limit value

          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090 -0.487325 -0.221804
3  0.648817       NaN -0.010978
4  1.665417       NaN -0.010978
5  2.799627       NaN       NaN

In [26]:
print('dataframe 切片成 Series：')
print(df.median())
print(df.median().shape)
print('-------')
print('Series 按广播机制默认匹配 dataframe 的 colums => col1 = 1.458275， col2 = 1.247230')
print(df.fillna(df.median())) # 默认 axis =0

dataframe 切片成 Series：
0    1.119464
1    0.313741
2   -0.864106
dtype: float64
(3,)
-------
Series 按广播机制默认匹配 dataframe 的 colums => col1 = 1.458275， col2 = 1.247230
          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090  0.313741 -0.221804
3  0.648817  0.313741 -0.010978
4  1.665417  0.313741 -0.864106
5  2.799627  0.313741 -0.864106

In [27]:
print(df.median(axis=1))
print(df.median(axis=1).shape) # 压缩掉了 axis=1，剩下 shape （6， ）
print('-------')
print(df.fillna(df.median(axis=1), axis=0)) # 默认 axis=0 对齐，fillna 暂不支持 axis >0 高维运算

0   -0.299639
1   -0.487325
2    0.145643
3    0.318919
4    1.665417
5    2.799627
dtype: float64
(6,)
-------
          0         1         2
0 -0.299639  1.114807 -1.506409
1  1.590112 -0.487325 -1.711102
2  0.513090 -0.487325 -0.221804
3  0.648817 -0.487325 -0.010978
4  1.665417 -0.487325  0.145643
5  2.799627 -0.487325  0.145643

# 7.2 数据转换 data transformation

## 删除重复内容

In [28]:
data = pd.DataFrame({'k1': ['one', 'two']*3+['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
data.duplicated() 
# 因为row 5, 6 的 k1, k2 列相同

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [31]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [32]:
data.drop_duplicates(subset=['k1']) # 默认保留第一个观察到的值组合

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
data.drop_duplicates(subset=['k1'], keep='last') # keep="last" will return the last one

    k1  k2  v1
4  one   3   4
6  two   4   6

In [34]:
data.drop_duplicates(subset=['k1', 'k2'])

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5

## 使用函数或映射mapping转换数据

In [35]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

### map修改值

In [36]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

data['animal'] = data['food'].map(meat_to_animal) # 修改值

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

### map映射值

In [37]:
def get_animal(x):
    return meat_to_animal[x]

get_animal('bacon')

'pig'

In [38]:
data['food'].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [39]:
data['food'].map(lambda x: meat_to_animal[x]) # lambda函数

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## 替换值

In [40]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [41]:
print(data.replace(-999, np.nan))
print('-' * 10)
print(data.replace([-999, -1000], np.nan))
print('-' * 10)
print(data.replace([-999, -1000], [np.nan, 0])) # 分别替换两个不同值

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64
----------
0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64
----------
0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [42]:
print(data.replace({-999: np.nan, -1_000: 0})) # 用 dict-like 语句传递参数
print('-' * 10)
print(f'data 值不变\n{data}\n.replace() 创建副本,不修改原视图')

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64
----------
data 值不变
0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64
.replace() 创建副本,不修改原视图

## 重命名轴标签

In [43]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [44]:
data.index.map(lambda x: x.upper())

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [45]:
def upper_func(x):
    return x.upper()

data.index.map(upper_func)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [46]:
print(data)
print('data 原视图未改变')
print('-'*10)
data.index = data.index.map(upper_func)
print(data)
print('data.index 被修改')

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11
data 原视图未改变
----------
          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11
data.index 被修改

上述方法直接改变了 `data.index`

如果不想改变原视图就实现 rename，可以使用 `rename` 函数

In [47]:
data_rename = data.rename(index=str.title, columns=str.upper) # copy

data_rename

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

`rename` 省去了为 `index` `columns` 赋值的麻烦

In [48]:
data # with modifying the original

          one  two  three  four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

## 离散化与分箱 Discretization and Binning

连续数据通常会被离散化或以其他方式分成“箱 bins”进行分析。

In [49]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]
age_categories = pd.cut(ages, bins)

age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [50]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [51]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [52]:
age_categories.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

在区间的字符串表示中，括号表示边是开的 （排他的），而方括号表示是闭的 （包含的）。

你可以通过传递 `right =False` 来改变哪一侧是闭合的：

In [53]:
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [54]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

如果你把整数个 bin 传递给 `pandas.cut` 而不是显式 bin 的边，它会根据数据中的最小值和最大值计算出等长 bin。

考虑一些均匀分布的数据被切成四分之一的情况：

In [55]:
data = rng.uniform(size=20)
data_cate = pd.cut(data, 4, precision=2) # 小数点显示精度，只影响显示，不影响计算
# 第一个bin的下界是数据的最小值，最后一个 bin 的上界是数据的最大值

In [56]:
data_cate.value_counts()

(0.005, 0.25]    7
(0.25, 0.5]      5
(0.5, 0.74]      4
(0.74, 0.99]     4
Name: count, dtype: int64

`pandas.qcut` 基于样本分位数对数据进行分组处理。根据数据分布不同，使用 `pandas.cut` 通常不会让每个箱的数据点数相同。由于 `pandas.qcut` 使用样本分位数，你会得到大小大致相同的箱：

In [57]:
data = rng.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)

quartiles

[(0.69, 4.08], (-0.6, 0.021], (0.69, 4.08], (0.021, 0.69], (-2.78, -0.6], ..., (-0.6, 0.021], (0.69, 4.08], (0.021, 0.69], (0.69, 4.08], (0.021, 0.69]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.78, -0.6] < (-0.6, 0.021] < (0.021, 0.69] < (0.69, 4.08]]

In [58]:
quartiles.value_counts()

(-2.78, -0.6]    250
(-0.6, 0.021]    250
(0.021, 0.69]    250
(0.69, 4.08]     250
Name: count, dtype: int64

In [59]:
#  可视化分箱过程
#   1 数据点分布:   1    2    3    4                      100   101   102
#   2              |    |    |    |-------- 巨大间隔 -----|    |    |
#   3 
#   4 pd.cut (等宽): |-------箱1-------|-------箱2-------|-------箱3-------|
#   5               宽度相等但点数不均   空箱              点数集中
#   6 
#   7 pd.qcut (等频): |-箱1-| |-箱2-| |-----------箱3------------|
#   8                 ≈2个点  ≈2个点            ≈3个点

In [60]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-2.7689999999999997, -1.254]    100
(-1.254, 0.0209]                 400
(0.0209, 1.367]                  400
(1.367, 4.083]                   100
Name: count, dtype: int64

## 检测和过滤异常值 Detecting and Filtering Outliers

In [61]:
data = pd.DataFrame(rng.standard_normal((1_000,4)))

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005541    -0.099911    -0.004954     0.001751
std       1.006501     1.004682     0.994045     0.980296
min      -3.088291    -3.818862    -3.299076    -2.845783
25%      -0.638579    -0.783746    -0.660765    -0.658472
50%       0.020156    -0.104342     0.013656     0.013279
75%       0.682693     0.554284     0.624453     0.648353
max       3.307190     3.087162     2.902788     3.335903

In [62]:
col2 = data[2]

col2[col2.abs() >3]

279   -3.222218
766   -3.299076
819   -3.146020
909   -3.172474
Name: 2, dtype: float64

要选择DataFrame中所有值大于 3 或–3 的行，可以使用 `.any`方法：

In [63]:
data[(data.abs() >3).any(axis='columns')]

            0         1         2         3
190  3.307190 -0.701852  0.347103  1.475817
279 -0.299526  0.165127 -3.222218  1.052052
316  0.835178  3.051162 -0.676384 -1.065489
462  0.588435 -3.382357  1.512633 -1.065803
497  0.847584 -1.047493 -0.367413  3.335903
529 -3.088291 -0.922157 -1.082018 -0.046005
533 -0.206620  3.087162 -0.765574  0.532641
615 -3.077630  1.732655  0.354303 -1.925484
766  0.680602  0.611415 -3.299076  0.225218
819  0.225250 -0.512838 -3.146020 -0.223873
821  3.072759  0.174257 -0.362155  0.887932
856  0.638403 -3.818862 -1.917264 -1.026712
909 -1.772993  0.376463 -3.172474  1.533277

设置`[-3,3]`的 cap values

In [64]:
data[data.abs()>3] = np.sign(data) * 3 # -3 or 3

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.005327    -0.098848    -0.004114     0.001415
std       1.004815     1.000362     0.991413     0.979210
min      -3.000000    -3.000000    -3.000000    -2.845783
25%      -0.638579    -0.783746    -0.660765    -0.658472
50%       0.020156    -0.104342     0.013656     0.013279
75%       0.682693     0.554284     0.624453     0.648353
max       3.000000     3.000000     2.902788     3.000000

语句 `np.sign（data）` 根据数据的符号（sign）是正的 or 负的 or 0，会产生 1 和 –1 和 0 的值：

In [65]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0  1.0 -1.0 -1.0
2  1.0  1.0  1.0 -1.0
3 -1.0  1.0 -1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

## 随机排列与抽样 Permutation and Random Sampling

In [66]:
df = pd.DataFrame(np.arange(5*7).reshape(5,7))
df

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34

In [67]:
sampler = rng.permutation(5) # 5 以内的数随机排序
sampler

array([1, 3, 4, 2, 0])

In [68]:
df.take(sampler) # 根据 sampler 随机数排序 index
# 创建一个copy

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [69]:
df.iloc[sampler] # 等效 .take

    0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6

In [70]:
col_sampler = rng.permutation(7)

col_sampler

array([1, 4, 0, 2, 6, 5, 3])

In [71]:
df.take(col_sampler, axis='columns') # 对 columns 采用 col_sampler

    1   4   0   2   6   5   3
0   1   4   0   2   6   5   3
1   8  11   7   9  13  12  10
2  15  18  14  16  20  19  17
3  22  25  21  23  27  26  24
4  29  32  28  30  34  33  31

抽样一个不重复的随机子集

In [72]:
df.sample(n=3)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
3  21  22  23  24  25  26  27

抽样一个可重复的子集 `replace = true`

In [73]:
df.sample(n=10, replace=True)

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
3  21  22  23  24  25  26  27
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
2  14  15  16  17  18  19  20
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
4  28  29  30  31  32  33  34
0   0   1   2   3   4   5   6

In [74]:
choices = pd.Series([5,7,-1,6,4])
choices.sample(n=10, replace=True)

4    4
3    6
0    5
4    4
3    6
0    5
4    4
3    6
2   -1
4    4
dtype: int64

## 指示/虚拟变量 Computing Indicator/Dummy Variables

  核心思想: <br>将分类变量（categorical variable）
  转换为二进制（0/1）数值矩阵，使分类数据能够被数学模型（如回归、机器学习）处理。

  错误做法（序数编码）：  
   1 # 将分类直接映射为1,2,3...会导致模型误解  
   `2 df['city'] = df['city'].map({'北京': 1, '上海': 2, '广州': 3})`  
   3 # 问题：模型会认为"广州 > 上海 > 北京"（数值大小关系），但这毫无意义！

  正确做法（虚拟变量）：  
   1 # 创建独立的二进制列  
   `2 city_dummies = pd.get_dummies(df['city'], prefix='city')`  
   3 # 结果：city_北京, city_上海, city_广州 三列，每列值为0或1

In [75]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [76]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [77]:
pd.get_dummies(df['key'], dtype = 'float')

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

在 DataFrame 的列名显示前缀 `prefix`

In [78]:
dummies = pd.get_dummies(df['key'], prefix='key', dtype=float)
df_with_dummies = df[['data1']].join(dummies)

df_with_dummies

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

关于为什么 `df[['data1']].join(dummies)` 要使用 `[[‘data1’]]`  

`df[[]]` 用于选择多列，返回 DataFrame  
=> `df[['a', 'b']]` ✅  
=> `df['a'. 'b']` ❌

In [79]:
print(df['data1'])
print(df['data1'].shape) # shape 是 Series，没有 .join(), .merge(), .groupby(), .pivot_table()..语法
print('-'*10)
print(df[['data1',]])
print(df[['data1',]].shape)  # shape 是 dataframe
# print(df['data1', 'key'])  # []报错

0    0
1    1
2    2
3    3
4    4
5    5
Name: data1, dtype: int64
(6,)
----------
   data1
0      0
1      1
2      2
3      3
4      4
5      5
(6, 1)

如果 DataFrame 中的一行属于多个类别，我们必须采用不同的方法来创建虚拟变量。  
例如： `‘Animation|Children's|Comedy’`

In [80]:
mnames = ["movie_id", "title", "genres"]

movies = pd.read_table("/Users/d0m999/Desktop/_bot/data_analysis/pydata-book-3rd-edition/datasets/movielens/movies.dat", 
                       sep="::", header=None, names=mnames, engine="python")
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [81]:
dummies = movies['genres'].str.get_dummies(sep='|')
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [82]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [83]:
print(movies_windic.iloc[0].shape) # Series
print(movies_windic.iloc[:1].shape) # DataFrame

(21,)
(1, 21)

统计应用的一个有用方法是与像 `pandas.cut` 这样的离散化函数结合：`pandas.get_dummies`

In [84]:
values = rng.uniform(size = 10)
values

array([0.04232711, 0.56574349, 0.27195567, 0.24153872, 0.9022807 ,
       0.2187114 , 0.99832588, 0.40083486, 0.57019126, 0.86736654])

In [85]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.cut(values, bins)

[(0.0, 0.2], (0.4, 0.6], (0.2, 0.4], (0.2, 0.4], (0.8, 1.0], (0.2, 0.4], (0.8, 1.0], (0.4, 0.6], (0.4, 0.6], (0.8, 1.0]]
Categories (5, interval[float64, right]): [(0.0, 0.2] < (0.2, 0.4] < (0.4, 0.6] < (0.6, 0.8] < (0.8, 1.0]]

In [86]:
pd.get_dummies(pd.cut(values, bins), dtype=int)

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           1           0           0           0           0
1           0           0           1           0           0
2           0           1           0           0           0
3           0           1           0           0           0
4           0           0           0           0           1
5           0           1           0           0           0
6           0           0           0           0           1
7           0           0           1           0           0
8           0           0           1           0           0
9           0           0           0           0           1

# 7.3 扩展数据类型

pandas 开发了一个扩展类型系统，允许添加即使 NumPy 原生不支持的新数据类型。这些新数据类型可以与来自 NumPy 数组的数据并列处理。

In [87]:
s = pd.Series([1,2,3,None])
print(s)
print('-'*10)
print(s.dtype)

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64
----------
float64

In [88]:
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s # 输出 <NA> 表示扩展类型数组缺少一个值。
# This uses the special pandas.NA sentinel value 哨兵值

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [89]:
s.isna()

0    False
1    False
2    False
3     True
dtype: bool

In [90]:
s.dtype

Int64Dtype()

In [91]:
print('is numpy NA?')
print(s[3] is np.nan)
print('-'*10)
print('is pandas NA?')
print(s[3] is pd.NA)

is numpy NA?
False
----------
is pandas NA?
True

我们也可以用简称 `“Int64”` 代替 `pd.Int64Dtype()` 来指定类型。必须大写，否则将是基于 `NumPy` 的非扩展类型：

In [92]:
s = pd.Series([1, 2, 3, None], dtype="Int64")

pandas 还有一种专门用于字符串数据的扩展类型，不使用 NumPy 对象数组（需要 pyarrow 库，可能需要单独安装）：

In [93]:
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s

0      one
1      two
2     <NA>
3    three
dtype: string

这些字符串数组通常占用更少的内存，且在处理大型数据集时计算效率通常更高。

扩展类型可以传递到系列 `astype` 方法，使你可以轻松地将转换作为 data cleaning 过程的一部分：

In [94]:
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})
df

     A      B      C
0  1.0    one  False
1  2.0    two   None
2  NaN  three  False
3  4.0   None   True

In [95]:
df['A'] =  df['A'].astype('Int64') # pandas type
df['B'] =  df["B"].astype("string")
df["C"] = df["C"].astype("boolean")
df

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [96]:
# fillna
df = df.ffill()

df['A'] =  df['A'].astype('int64') # numpy type: 'int64' or np.int64
df['B'] =  df["B"].astype('str')
df["C"] = df["C"].astype('bool')
print(df)
print('-'*10)
print(df['C'])

   A      B      C
0  1    one  False
1  2    two  False
2  2  three  False
3  4  three   True
----------
0    False
1    False
2    False
3     True
Name: C, dtype: bool

# 7.4 字符串处理 String Manipulation

## Python 内置字符串对象方法

In [97]:
val = 'a,b, guido'
val.split(',')

['a', 'b', ' guido']

In [98]:
pieces = [x.strip() for x in val.split(',')]  # 搭配.strip()去除空格
pieces

['a', 'b', 'guido']

In [99]:
first, second, third = pieces

first + '::' + second + '::' + third

'a::b::guido'

In [100]:
# 更加pythonic的方法是：
"::".join(pieces)

'a::b::guido'

定位 字符串

In [101]:
'a' in val

True

In [102]:
'a', 'b' in val

('a', True)

In [103]:
val.index('b')  # 返回第一个被查询对象的 index

2

In [104]:
# val.index('.')  

# 如果未被找到，触发异常

# ---------------------------------------------------------------------------
# ValueError                                Traceback (most recent call last)
# Cell In[105], line 1
# ----> 1 val.index('.')

# ValueError: substring not found

In [105]:
val.find('.')  # .find() 没找到对象，返回-1

-1

In [106]:
val.count(',')

2

`replace` 将一种模式的出现替换为另一种模式。它也常用于删除模式，通过传递空字符串：

In [107]:
val.replace(',',':')

'a:b: guido'

In [108]:
val.replace(',','') # 等效于删除

'ab guido'

In [109]:
val.endswith('do')

True

## 正则表达式 regular expressions

In [110]:
import re # regular expressions

In [111]:
text = "foo    bar\t baz  \tqux"
re.split(r'\s+', text)

['foo', 'bar', 'baz', 'qux']

你可以用 `re.compile` 自己编译正则表达式，形成一个可复用的正则表达式对象：

In [112]:
regex = re.compile(r'\s+')

regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [113]:
regex.findall(text)

['    ', '\t ', '  \t']

`match`和`search`与 `findall` 关系密切。  
`findall` 会返回字符串中的所有匹配, 取所有邮箱 → `re.findall()`  
`search`只返回第一个匹配, 查找错误信息 → `re.search()`  
更严格地，`match`只返回字符串的开头. 手机号验证 → `re.match()`

In [114]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive 忽略大小写
regex = re.compile(pattern, flags=re.IGNORECASE)

In [115]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [116]:
m = regex.search(text) # 仅返回第一个对象
m

In [117]:
print(regex.match(text))

None

In [118]:
print(regex.sub('REDACTED', text)) # 将匹配字符串替换成 新字符串

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [119]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})" # return tuple
regex = re.compile(pattern, flags=re.IGNORECASE)  # re.IGNORECASE 忽略大小写

In [120]:
regex.findall("wesm@bright.net")

[('wesm', 'bright', 'net')]

In [121]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [122]:
m=regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [123]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))
# .sub() 通过 \1, \2, \3 读取每个 group

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [124]:
def validate_phone(phone):
    pattern = r'1[3-9]\d{9}'
    regex = re.compile(pattern)
    return bool(regex.match(phone))

np_list = list(np.arange(13812345678, 13812345688).astype(str)) + ['abc1389998y98y']
phone_list = pd.Series(np_list)
phone_list

0        13812345678
1        13812345679
2        13812345680
3        13812345681
4        13812345682
5        13812345683
6        13812345684
7        13812345685
8        13812345686
9        13812345687
10    abc1389998y98y
dtype: object

In [125]:
phone_list.apply(validate_phone)

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8      True
9      True
10    False
dtype: bool

In [126]:
phone_list[phone_list.apply(validate_phone)]

0    13812345678
1    13812345679
2    13812345680
3    13812345681
4    13812345682
5    13812345683
6    13812345684
7    13812345685
8    13812345686
9    13812345687
dtype: object

## pandas 的字符串函数

In [127]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [128]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [129]:
# check whether each mail addr has 'gmail'
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [130]:
data_as_string = data.astype('string') # 转化为 pandas type
data_as_string

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

### Series.str 访问器

  Series 访问器设计的核心智慧：  

   1. 命名空间隔离：避免方法名冲突，`.str`专门处理字符串，`.dt`专门处理时间  
   2. 类型安全：只有合适的数据类型才有对应的访问器，避免无意义的操作  
   3. 语义清晰：`series.contains()`（元素包含）vs `series.str.contains()`（字符串包含）  
   4. 性能优化：访问器方法都是向量化实现，比Python循环快10-100倍  
   5. 链式操作：支持流畅的方法链，代码更简洁优雅

In [171]:
#     1 Series 对象
#     2 ├── 数据: ['abc123', 'def456', 'ghi789']
#     3 ├── 索引: [0, 1, 2]
#     4 ├── 属性和方法
#     5 │   ├── .values → NumPy数组
#     6 │   ├── .index → 索引对象
#     7 │   ├── .dtype → 数据类型
#     8 │   └── .str → StringMethods访问器 ← 关键！
#     9 │           ├── .findall()
#    10 │           ├── .extract()
#    11 │           ├── .contains()
#    12 │           ├── .replace()
#    13 │           └── ... 更多字符串方法
#    14 └── 其他访问器
#    15     ├── .dt → DateTimeMethods (时间序列)
#    16     ├── .cat → CategoricalMethods (分类数据)
#    17     └── .sparse → SparseMethods (稀疏数据)

In [132]:
data_as_string.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [133]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})" # 正则表达式分组 groups
matches = data.str.findall(pattern, flags=re.IGNORECASE)  
matches
# 通过 .str 访问器才能用 .findall，因为.findall 是专门处理str 的 method

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [134]:
print(matches.str.get(0)) # .get 方法
print(matches.str[0]) # [] 方法

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object
Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [135]:
print(matches.str[0].str.get(1))
print(matches.str[0].str[1])

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object
Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [136]:
print(data)
print(data.str[:5])

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object
Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [137]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

### DataFrame 没有访问器. 如何使用 Series 访问器 (`.str`, `.dt`)

In [138]:
#    1 需要处理DataFrame字符串?
#    2 ├─ 单列处理 → df['col'].str.method() (最快)
#    3 ├─ 多列相同处理 → 循环 + df[col].str.method()
#    4 ├─ 复杂逻辑处理 → df.apply(function, axis=1) (最灵活)
#    5 ├─ 所有元素相同处理 → df.applymap() (简单但慢)
#    6 └─ 流水线处理 → df.assign()链式操作 (最优雅)

# 7.5 Categorical Data

## 背景和动机

  为了省内存和算得快，Pandas 搞了个“代号系统”，把重复的字符串变成了整数 ID。这个系统就叫 Categorical。  
  我把“Background and Motivation”这一部分拆解为三个步骤来解析：

  1. 痛点：重复数据的存储浪费

  想象一下，你有一张包含 1000 万行数据的用户表，其中有一列是 `country`（国家）。

  虽然有 1000 万行，但实际上“国家”这个值的种类是非常有限的（大概也就 200 个左右）。这就意味着，像 `"United
  States of America"` 这样很长的字符串，会在你的内存里重复出现几百万次。

  这就好比：
  你在填 1000 张表格。每一张表格都要手写一遍“美利坚合众国”。
   * 不仅手累（占用内存大）
   * 处理起来也慢（比较字符串比比较数字慢得多）。

In [139]:
values = pd.Series(['apple', 'orange', 'apple', 'apple'] * 2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [140]:
values.unique()

array(['apple', 'orange'], dtype=object)

In [141]:
values.value_counts()

apple     6
orange    2
Name: count, dtype: int64

  2. 解决方案：维度表（Dimension Table）

  Wes McKinney 在书中提到了 `"Dimension Table"`（维度表），这其实是数据库里的一种经典优化手段。

  我们可以把数据拆成两部分来存：

   1. 词典（也就是书里说的 `Dimension Table`）：只存那 200 个不重复的国家名字。
   2. 编码（Codes）：在原始的 1000 万行数据里，不再存字符串，而是存这 200 个国家对应的整数 ID。

   我为你画了一个 ASCII 图来演示这个转换过程（First Principle: Dictionary-encoded representation）：

In [142]:

#     1 【原始数据】(内存占用巨大)
#     2 +-------+--------------------------+
#     3 |  ID   |         Country          |
#     4 +-------+--------------------------+
#     5 |   1   | United States of America |  <-- 存了24个字符
#     6 |   2   | United States of America |  <-- 又存了24个字符
#     7 |   3   | Japan                    |
#     8 |   4   | United States of America |
#     9 +-------+--------------------------+
#    10 
#    11         ⬇️ 转换 (Encoding) ⬇️
#    12 
#    13 【Pandas Categorical 内部结构】(内存极小)
#    14 
#    15 (1) 词典 (Categories)          (2) 编码 (Codes)
#    16     这里只存唯一值                  这里只存整数(0,1,2...)
#    17 +----+--------------------------+    +-------+--------+
#    18 | ID |  Value (Category)        |    | RowID |  Code  |
#    19 +----+--------------------------+    +-------+--------+
#    20 | 0  | United States of America |    |   1   |   0    | <-- 0 代表 US
#    21 | 1  | Japan                    |    |   2   |   0    |
#    22 +----+--------------------------+    |   3   |   1    | <-- 1 代表 Japan
#    23                                      |   4   |   0    |
#    24                                      +-------+--------+

  书中的核心术语解析：
   * Categorical Representation: 就是上面这种“用整数代表字符串”的存储方式。
   * Categories (类别): 那个只存唯一值的词典（如 US, Japan）。
   * Codes (编码): 那个全是整数的数组（如 0, 0, 1, 0）。

In [143]:
values = pd.Series([0, 1, 0, 0] * 2)
dimension_table = pd.Series(['apple', 'orange'])
print(values)
print(dimension_table)

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64
0     apple
1    orange
dtype: object

In [144]:
dimension_table.take(values)

# .take 表达的意思是：“我有一堆索引，请帮我瞬间映射回真实值”。
#  常见陷阱与注意事项

#    1. 越界错误: 如果你的 dimension_table 只有 3 个元素（索引 0, 1, 2），但你的 values 里包含了一个 5，那么
#       .take() 会抛出 IndexError。
#    2. 处理缺失值: 在真实的 Categorical 数据内部，如果某个值是缺失的（NaN），它的 code 通常会被设为 -1。但在
#       .take() 语法中，不支持 -1，你需要先处理掉这些值。

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

  3. 动机 (Motivation)：我们图什么？

  书中列出了这样做的根本动机，总结起来就是三点：

  A. 内存优化 (Memory)
  存一个整数（比如 `0`）只需要 1 到 4 个字节。存一个字符串 `"United States of America"`
  需要几十个字节。当数据量上亿时，这个压缩效果是惊人的。

  B. 性能提升 (Performance)
  计算机处理数字比处理文字快得多。
   * 排序：直接比大小 `0 < 1` 极快。
   * 分组 (GroupBy)：按整数 ID 分组比按字符串哈希分组更快。

  C. 逻辑顺序 (Semantics) - 这一点常被初学者忽略
  字符串只能按字母排序（Alphabetical），但有时我们需要逻辑排序（Logical）。
   * 字符串排序: `"High" < "Low" < "Medium"` (按首字母 H < L < M，这是错的逻辑)
   * Categorical 排序: 我们可以强制规定顺序：`Low (0) < Medium (1) < High (2)`。

## Categorical Extension Type in pandas

In [145]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N = len(fruits) # 有多少个水果对象

df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N),
                   'weight': rng.uniform(0, 4, size=N)},
                    columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple      7  2.836883
1          1  orange      3  0.832295
2          2   apple      8  2.036582
3          3   apple      4  1.164826
4          4   apple     12  2.802394
5          5  orange      6  3.769051
6          6   apple     14  0.186956
7          7   apple      8  2.527850

In [146]:
# df['fruit'] is an array of Python string objects. 
# We can convert it to categorical by calling:

fruit_cat = df['fruit'].astype('category')

fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [147]:
type(fruit_cat.array)

pandas.core.arrays.categorical.Categorical

In [148]:
c = fruit_cat.array

# The Categorical object has categories and codes attributes:
print(c.categories)
print(c.codes) # 列表记录的值（包含重复顺序）

Index(['apple', 'orange'], dtype='object')
[0 1 0 0 0 1 0 0]

In [149]:
# to get a mapping between codes and categories is:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [150]:
# 将 dataframe 的 ‘fruit’ 列转换为 pandas.Categorical
df['fruit'] = df['fruit'].astype('category')
df['fruit']

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

也可以直接通过 `pd.Categorical()` 创建类别：

In [151]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])

my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [152]:
# 逆向
categories = ['foo', 'bar', 'baz']
codes = [0, 1, 2, 0, 0, 1]

my_cat_2 = pd.Categorical.from_codes(codes, categories)

my_cat_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

除非明确说明，类别转换不假设类别有特定的顺序。因此， `categories`数组的顺序可能会根据输入数据的顺序不同。使用 `from_codes` 或其他构造函数时，你可以表示类别具有有意义的排序：

In [153]:
ordered_cat = pd.Categorical.from_codes(codes, categories, ordered=True)

ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [154]:
my_cat_2.as_ordered() # 等效于上述codes

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

## Computations with Categoricals

In [155]:
draws = rng.standard_normal(1000)

draws[:5]

array([ 1.52611057,  0.06176593, -0.32454971,  0.35569434, -0.66371521])

### 与 pd.qcut() 结合

In [156]:
bins = pd.qcut(draws, 4)

bins

[(0.688, 2.851], (0.032, 0.688], (-0.719, 0.032], (0.032, 0.688], (-0.719, 0.032], ..., (-3.154, -0.719], (-3.154, -0.719], (-3.154, -0.719], (0.032, 0.688], (-3.154, -0.719]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.154, -0.719] < (-0.719, 0.032] < (0.032, 0.688] < (0.688, 2.851]]

In [157]:
# 数字分箱结果可能对于生成一篇报告来说不太直观，我们可以为每个箱子指定名称标签：
group_names = ['Q1', 'Q2', 'Q3', 'Q4']
bins = pd.qcut(draws, 4, labels=group_names)
bins

['Q4', 'Q3', 'Q2', 'Q3', 'Q2', ..., 'Q1', 'Q1', 'Q1', 'Q3', 'Q1']
Length: 1000
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [158]:
bins.codes[:10]

array([3, 2, 1, 2, 1, 1, 2, 0, 2, 1], dtype=int8)

In [160]:
bins = pd.Series(bins, name='quartile')

results = (pd.Series(draws)
           .groupby(bins, observed=True) # future warning: 默认将来会改为 True。observed=True 的作用是只返回实际出现的categories组别，忽略 NaN
              .agg(['count', 'min', 'max'])
              .reset_index())
results

  quartile  count       min       max
0       Q1    250 -3.152509 -0.724729
1       Q2    250 -0.717218  0.030874
2       Q3    250  0.033121  0.687757
3       Q4    250  0.687853  2.851068

In [161]:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

### 提升性能和内存使用率

In [167]:
N = 10_000_000

labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

categories = labels.astype('category') # 将 labels 转化为 pandas 分类数据

print(categories.dtype)
print(labels.dtype)

print(categories.memory_usage(deep=True))
print(labels.memory_usage(deep=True))

category
object
10000540
600000128

In [163]:
%time _ = labels.astype('category')

CPU times: user 360 ms, sys: 21 ms, total: 381 ms
Wall time: 381 ms

`GroupBy` 运算在类别中可以显著加快

In [164]:
%timeit labels.value_counts()

351 ms ± 1.04 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

In [ ]:
%timeit categories.value_counts() # pandas.Categorical 的运算显著快

16.8 ms ± 466 μs per loop (mean ± std. dev. of 7 runs, 100 loops each)

## Categorical Methods

Series containing `categorical` data have several special methods similar to the `Series.str`

In [172]:
#     1 Series 对象
#     2 ├── 数据: ['abc123', 'def456', 'ghi789']
#     3 ├── 索引: [0, 1, 2]
#     4 ├── 属性和方法
#     5 │   ├── .values → NumPy数组
#     6 │   ├── .index → 索引对象
#     7 │   ├── .dtype → 数据类型
#     8 │   └── .str → StringMethods访问器 ← 关键！
#     9 │           ├── .findall()
#    10 │           ├── .extract()
#    11 │           ├── .contains()
#    12 │           ├── .replace()
#    13 │           └── ... 更多字符串方法
#    14 └── 其他访问器
#    15     ├── .dt → DateTimeMethods (时间序列)
#    16     ├── .cat → CategoricalMethods (分类数据)
#    17     └── .sparse → SparseMethods (稀疏数据)

In [168]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [169]:
cat_s.cat.categories # .cat 访问器

Index(['a', 'b', 'c', 'd'], dtype='object')

In [170]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

假设我们知道该数据的实际类别集合超出了数据中观察到的四个值。我们可以用 `set_categories` 方法来更改它们：

In [ ]:
actual_categories = ['a', 'b', 'c', 'd', 'e']

cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2 # 类别 'e' 虽然未出现，但被包含在 categories 中

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [174]:
print(cat_s.value_counts())
print(cat_s2.value_counts()) # 包含 'e' 类别，计数为0

a    2
b    2
c    2
d    2
Name: count, dtype: int64
a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

在大型数据集中，类别化常被用作节省内存和提升性能的便捷工具。在筛选大型数据帧或系列后，许多类别可能不会出现在数据中。  
为帮助实现这一点，我们可以使用 `remove_unused_categories` 方法来删除未观察到的类别：

In [ ]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]
cat_s3
# categories 'c' 和 'd' 依旧存在，占用内存

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [ ]:
cat_s3.cat.remove_unused_categories()
 # categories 'c' 和 'd' 被移除

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

### Creating dummy variables for modeling

当你使用统计或机器学习工具时，通常会将分类数据转换为 *dummy variables* ，也称为 *one-hot encoding*。  
这涉及创建一个 DataFrame，每个不同类别都有一列;这些列中，某一类别的出现次数为 `1`，其他类别为 `0`。

In [184]:
cate_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

pd.get_dummies(cate_s, dtype=float, prefix='category')

   category_a  category_b  category_c  category_d
0         1.0         0.0         0.0         0.0
1         0.0         1.0         0.0         0.0
2         0.0         0.0         1.0         0.0
3         0.0         0.0         0.0         1.0
4         1.0         0.0         0.0         0.0
5         0.0         1.0         0.0         0.0
6         0.0         0.0         1.0         0.0
7         0.0         0.0         0.0         1.0